results/pgbenchResults_vbox_windows_ubuntu_5gb.txt
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 7.768 ms
tps = 1287.381606 (including connections establishing)
tps = 1291.001464 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 7.985 ms
tps = 1252.341653 (including connections establishing)
tps = 1255.655156 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 9.177 ms
tps = 1089.709083 (including connections establishing)
tps = 1093.309724 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 9.273 ms
tps = 1078.400790 (including connections establishing)
tps = 1080.843137 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 10.427 ms
tps = 959.077494 (including connections establishing)
tps = 961.769704 (excluding connections establishing)