results/pgbenchResults_vmware_mac_centos_8.txt
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 18.369 ms
tps = 544.403197 (including connections establishing)
tps = 548.324358 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 25.619 ms
tps = 390.342506 (including connections establishing)
tps = 395.109367 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 21.854 ms
tps = 457.580857 (including connections establishing)
tps = 461.916124 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 33.707 ms
tps = 296.672856 (including connections establishing)
tps = 297.917133 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 27.711 ms
tps = 360.865995 (including connections establishing)
tps = 364.526100 (excluding connections establishing)