results/pgbenchResults_vmware_mac_debian_2.txt
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 9.769 ms
tps = 1023.640632 (including connections establishing)
tps = 1027.702141 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 8.086 ms
tps = 1236.635284 (including connections establishing)
tps = 1243.841005 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 7.894 ms
tps = 1266.763488 (including connections establishing)
tps = 1272.757657 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 8.818 ms
tps = 1134.085781 (including connections establishing)
tps = 1139.844374 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 7.881 ms
tps = 1268.842202 (including connections establishing)
tps = 1274.754590 (excluding connections establishing)